ИТ_Фирма/src/DataProcessors/УстановкаЦенПродажи/УстановкаЦенПродажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УстановкаЦенПродажи</name>
</mdclass:DataProcessor>

ИТ_Фирма/src/InformationRegisters/ЦеныПродажиНоменклатуры/ЦеныПродажиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПродажиНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Денежный</types>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИТ_Фирма/src/DataProcessors/УстановкаЦенПродажи/Forms/Форма/Module.bsl
&НаСервере
Процедура УстановитьФиксированнуюЦенуНаСервере(ОбрабатываемаяНоменклатура)

	Для Каждого Номенклатура Из ОбрабатываемаяНоменклатура Цикл

		МенеджерЗаписи = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Номенклатура = Номенклатура;
		МенеджерЗаписи.Период = ТекущаяДата();
		МенеджерЗаписи.Цена = ФиксированнаяЦена;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	УстановитьЦенуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВариантУстановкиПриИзменении(Элемент)	

	УстановитьДоступностьПолейВвода();	
	
КонецПроцедуры


&НаСервере 
Процедура УстановитьЦенуНаСервере()

	ОбрабатываемаяНоменклатура = НоменклатураКОбработке();
	
	Если ВариантУстановки = 0 Тогда 
		
		УстановитьФиксированнуюЦенуНаСервере(ОбрабатываемаяНоменклатура);
		
	ИначеЕсли ВариантУстановки = 1 Тогда 
		
		ФиксированнаяЦена = "";
		УдалитьЦену(ОбрабатываемаяНоменклатура);
		
	ИначеЕсли ВариантУстановки = 2 Тогда
		
		УстановитьПроцентОтЦены(ОбрабатываемаяНоменклатура);
			
	КонецЕсли;
КонецПроцедуры 


&НаСервере 
Процедура УдалитьЦену(ОбрабатываемаяНоменклатура)
	
	Для Каждого Номенклатура Из ОбрабатываемаяНоменклатура Цикл
		
		НаборЗаписей = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Номенклатура);
		НаборЗаписей.Записать();
		
	КонецЦикла;
КонецПроцедуры 	

&НаСервере
Процедура УстановитьПроцентОтЦены(ОбрабатываемаяНоменклатура)

	Для Каждого Номенклатура Из ОбрабатываемаяНоменклатура Цикл
		
		ПоследняяЦена = ПолучитьПоследнююЦенуНоменклатуры(Номенклатура);
		
		Если ПоследняяЦена = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЦена = ПоследняяЦена * (1+ ПроцентОтТекущейЦены/100);
		
		УстановитьНовуюЦенуНоменклатуры(Номенклатура, НоваяЦена);

	КонецЦикла;	

КонецПроцедуры	


&НаСервере
Функция ПолучитьПоследнююЦенуНоменклатуры(Номенклатура)
	
	Отбор = Новый Структура;
	Отбор.Вставить("Номенклатура", Номенклатура); 
	
	Если ЗначениеЗаполнено(ДатаАктуальности) Тогда
	
		ПоследняяЦена = РегистрыСведений.ЦеныПродажиНоменклатуры.ПолучитьПоследнее(ДатаАктуальности, Отбор);
		
	Иначе 
		
		ПоследняяЦена = РегистрыСведений.ЦеныПродажиНоменклатуры.ПолучитьПоследнее(, Отбор);
		
	КонецЕсли;
	
	Возврат ПоследняяЦена.Цена;	
	
КонецФункции

&НаСервере
Процедура УстановитьНовуюЦенуНоменклатуры(Номенклатура,Цена); 

	МенеджерЗаписи = РегистрыСведений.ЦеныПродажиНоменклатуры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура = Номенклатура;
	МенеджерЗаписи.Период = ТекущаяДата();
	МенеджерЗаписи.Цена = Цена;
	МенеджерЗаписи.Записать();


КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьПолейВвода();
	ДатаАктуальности = ТекущаяДата();
	
КонецПроцедуры


&НаКлиенте 
Процедура УстановитьДоступностьПолейВвода()
	
	Элементы.ФиксированнаяЦена.Доступность = (ВариантУстановки = 0);	
	Элементы.ПроцентОтТекущейЦены.Доступность = (ВариантУстановки = 2);
	Элементы.ДатаАктуальности.Доступность = (ВариантУстановки = 2);
	
КонецПроцедуры	


&НаСервере
Функция НоменклатураКОбработке();

	ОбрабатываемаяНоменклатура = Новый Массив;
	
	Для Каждого СтрокаСписка Из СписокНоменклатуры Цикл
		
		НоменклатураВСтроке = СтрокаСписка.Номенклатура;
		
		Если НоменклатураВСтроке.ЭтоГруппа Тогда
			
			ДополнитьМассивЭлементамиВложеннымиВГруппу(НоменклатураВСтроке, ОбрабатываемаяНоменклатура);
			
		Иначе 
			
			ОбрабатываемаяНоменклатура.Добавить(НоменклатураВСтроке);
			
		КонецЕсли;	
		
			Возврат ОбрабатываемаяНоменклатура;
		
	КонецЦикла;	
		
КонецФункции	
	
&НаСервере 
Процедура ДополнитьМассивЭлементамиВложеннымиВГруппу(ГруппаНоменклатуры,ОбрабатываемаяНоменклатура);

	Выборка = Справочники.Номенклатура.Выбрать(ГруппаНоменклатуры);
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
			
			ДополнитьМассивЭлементамиВложеннымиВГруппу(Выборка.Ссылка, ОбрабатываемаяНоменклатура);
			
		Иначе
			
			ОбрабатываемаяНоменклатура.Добавить(Выборка.Ссылка);
			
		КонецЕсли;	
		
	КонецЦикла;	


КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура();
	
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
		
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Элементы.СписокНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	

	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(ВыбранноеЗначение) <> Тип("Массив") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для Каждого ВыбранныеДанные Из ВыбранноеЗначение Цикл
		
		СтрокаТаблицы = СписокНоменклатуры.Добавить();
		СтрокаТаблицы.Номенклатура = ВыбранныеДанные;
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы,ВыбранныеДанные);
		
	КонецЦикла;
	
	
	Элементы.СписокНоменклатуры.Обновить();	
		
		
КонецПроцедуры
